#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Создайте списки:

# моя семья (минимум 3 элемента, есть еще дедушки и бабушки, если что)
my_family = ['mum', 'dad', 'brother']


# список списков приблизителного роста членов вашей семьи
my_family_height = [
    # ['имя', рост],
    ['mum', 160], ['dad', 180], ['brother', 179]
]

# Выведите на консоль рост отца в формате
#   Рост отца - ХХ см

print (my_family[1], "'s height - ",  my_family_height[1][1], sep = '')

# Выведите на консоль общий рост вашей семьи как сумму ростов всех членов
#   Общий рост моей семьи - ХХ см
x = 0 
n = []#список роста без лишних элементов
for i in my_family_height:
    n.append (my_family_height[x][1])#заплняем список из списка чтоб sum сработала
    x +=1
x = sum(n)
print ('summary height of my famaly - ', x, sep = '')

